SpenceKonde/megaTinyCore/megaavr/extras/ioheaders/iotn824.h
/* EVSYS.CHANNEL1  bit masks and bit positions */
#define EVSYS_CHANNEL1_gm  0xFF  /* Channel 1 generator select group mask. */
#define EVSYS_CHANNEL1_gp  0  /* Channel 1 generator select group position. */
#define EVSYS_CHANNEL10_bm  (1<<0)  /* Channel 1 generator select bit 0 mask. */
#define EVSYS_CHANNEL10_bp  0  /* Channel 1 generator select bit 0 position. */
#define EVSYS_CHANNEL11_bm  (1<<1)  /* Channel 1 generator select bit 1 mask. */
#define EVSYS_CHANNEL11_bp  1  /* Channel 1 generator select bit 1 position. */
#define EVSYS_CHANNEL12_bm  (1<<2)  /* Channel 1 generator select bit 2 mask. */
#define EVSYS_CHANNEL12_bp  2  /* Channel 1 generator select bit 2 position. */
#define EVSYS_CHANNEL13_bm  (1<<3)  /* Channel 1 generator select bit 3 mask. */
#define EVSYS_CHANNEL13_bp  3  /* Channel 1 generator select bit 3 position. */
#define EVSYS_CHANNEL14_bm  (1<<4)  /* Channel 1 generator select bit 4 mask. */
#define EVSYS_CHANNEL14_bp  4  /* Channel 1 generator select bit 4 position. */
#define EVSYS_CHANNEL15_bm  (1<<5)  /* Channel 1 generator select bit 5 mask. */
#define EVSYS_CHANNEL15_bp  5  /* Channel 1 generator select bit 5 position. */
#define EVSYS_CHANNEL16_bm  (1<<6)  /* Channel 1 generator select bit 6 mask. */
#define EVSYS_CHANNEL16_bp  6  /* Channel 1 generator select bit 6 position. */
#define EVSYS_CHANNEL17_bm  (1<<7)  /* Channel 1 generator select bit 7 mask. */
#define EVSYS_CHANNEL17_bp  7  /* Channel 1 generator select bit 7 position. */

/* EVSYS.CHANNEL2  bit masks and bit positions */
#define EVSYS_CHANNEL2_gm  0xFF  /* Channel 2 generator select group mask. */
#define EVSYS_CHANNEL2_gp  0  /* Channel 2 generator select group position. */
#define EVSYS_CHANNEL20_bm  (1<<0)  /* Channel 2 generator select bit 0 mask. */
#define EVSYS_CHANNEL20_bp  0  /* Channel 2 generator select bit 0 position. */
#define EVSYS_CHANNEL21_bm  (1<<1)  /* Channel 2 generator select bit 1 mask. */
#define EVSYS_CHANNEL21_bp  1  /* Channel 2 generator select bit 1 position. */
#define EVSYS_CHANNEL22_bm  (1<<2)  /* Channel 2 generator select bit 2 mask. */
#define EVSYS_CHANNEL22_bp  2  /* Channel 2 generator select bit 2 position. */
#define EVSYS_CHANNEL23_bm  (1<<3)  /* Channel 2 generator select bit 3 mask. */
#define EVSYS_CHANNEL23_bp  3  /* Channel 2 generator select bit 3 position. */
#define EVSYS_CHANNEL24_bm  (1<<4)  /* Channel 2 generator select bit 4 mask. */
#define EVSYS_CHANNEL24_bp  4  /* Channel 2 generator select bit 4 position. */
#define EVSYS_CHANNEL25_bm  (1<<5)  /* Channel 2 generator select bit 5 mask. */
#define EVSYS_CHANNEL25_bp  5  /* Channel 2 generator select bit 5 position. */
#define EVSYS_CHANNEL26_bm  (1<<6)  /* Channel 2 generator select bit 6 mask. */
#define EVSYS_CHANNEL26_bp  6  /* Channel 2 generator select bit 6 position. */
#define EVSYS_CHANNEL27_bm  (1<<7)  /* Channel 2 generator select bit 7 mask. */
#define EVSYS_CHANNEL27_bp  7  /* Channel 2 generator select bit 7 position. */

/* EVSYS.CHANNEL3  bit masks and bit positions */
#define EVSYS_CHANNEL3_gm  0xFF  /* Channel 3 generator select group mask. */
#define EVSYS_CHANNEL3_gp  0  /* Channel 3 generator select group position. */
#define EVSYS_CHANNEL30_bm  (1<<0)  /* Channel 3 generator select bit 0 mask. */
#define EVSYS_CHANNEL30_bp  0  /* Channel 3 generator select bit 0 position. */
#define EVSYS_CHANNEL31_bm  (1<<1)  /* Channel 3 generator select bit 1 mask. */
#define EVSYS_CHANNEL31_bp  1  /* Channel 3 generator select bit 1 position. */
#define EVSYS_CHANNEL32_bm  (1<<2)  /* Channel 3 generator select bit 2 mask. */
#define EVSYS_CHANNEL32_bp  2  /* Channel 3 generator select bit 2 position. */
#define EVSYS_CHANNEL33_bm  (1<<3)  /* Channel 3 generator select bit 3 mask. */
#define EVSYS_CHANNEL33_bp  3  /* Channel 3 generator select bit 3 position. */
#define EVSYS_CHANNEL34_bm  (1<<4)  /* Channel 3 generator select bit 4 mask. */
#define EVSYS_CHANNEL34_bp  4  /* Channel 3 generator select bit 4 position. */
#define EVSYS_CHANNEL35_bm  (1<<5)  /* Channel 3 generator select bit 5 mask. */
#define EVSYS_CHANNEL35_bp  5  /* Channel 3 generator select bit 5 position. */
#define EVSYS_CHANNEL36_bm  (1<<6)  /* Channel 3 generator select bit 6 mask. */
#define EVSYS_CHANNEL36_bp  6  /* Channel 3 generator select bit 6 position. */
#define EVSYS_CHANNEL37_bm  (1<<7)  /* Channel 3 generator select bit 7 mask. */
#define EVSYS_CHANNEL37_bp  7  /* Channel 3 generator select bit 7 position. */

/* EVSYS.CHANNEL4  bit masks and bit positions */
#define EVSYS_CHANNEL4_gm  0xFF  /* Channel 4 generator select group mask. */
#define EVSYS_CHANNEL4_gp  0  /* Channel 4 generator select group position. */
#define EVSYS_CHANNEL40_bm  (1<<0)  /* Channel 4 generator select bit 0 mask. */
#define EVSYS_CHANNEL40_bp  0  /* Channel 4 generator select bit 0 position. */
#define EVSYS_CHANNEL41_bm  (1<<1)  /* Channel 4 generator select bit 1 mask. */
#define EVSYS_CHANNEL41_bp  1  /* Channel 4 generator select bit 1 position. */
#define EVSYS_CHANNEL42_bm  (1<<2)  /* Channel 4 generator select bit 2 mask. */
#define EVSYS_CHANNEL42_bp  2  /* Channel 4 generator select bit 2 position. */
#define EVSYS_CHANNEL43_bm  (1<<3)  /* Channel 4 generator select bit 3 mask. */
#define EVSYS_CHANNEL43_bp  3  /* Channel 4 generator select bit 3 position. */
#define EVSYS_CHANNEL44_bm  (1<<4)  /* Channel 4 generator select bit 4 mask. */
#define EVSYS_CHANNEL44_bp  4  /* Channel 4 generator select bit 4 position. */
#define EVSYS_CHANNEL45_bm  (1<<5)  /* Channel 4 generator select bit 5 mask. */
#define EVSYS_CHANNEL45_bp  5  /* Channel 4 generator select bit 5 position. */
#define EVSYS_CHANNEL46_bm  (1<<6)  /* Channel 4 generator select bit 6 mask. */
#define EVSYS_CHANNEL46_bp  6  /* Channel 4 generator select bit 6 position. */
#define EVSYS_CHANNEL47_bm  (1<<7)  /* Channel 4 generator select bit 7 mask. */
#define EVSYS_CHANNEL47_bp  7  /* Channel 4 generator select bit 7 position. */

/* EVSYS.CHANNEL5  bit masks and bit positions */
#define EVSYS_CHANNEL5_gm  0xFF  /* Channel 5 generator select group mask. */
#define EVSYS_CHANNEL5_gp  0  /* Channel 5 generator select group position. */
#define EVSYS_CHANNEL50_bm  (1<<0)  /* Channel 5 generator select bit 0 mask. */
#define EVSYS_CHANNEL50_bp  0  /* Channel 5 generator select bit 0 position. */
#define EVSYS_CHANNEL51_bm  (1<<1)  /* Channel 5 generator select bit 1 mask. */
#define EVSYS_CHANNEL51_bp  1  /* Channel 5 generator select bit 1 position. */
#define EVSYS_CHANNEL52_bm  (1<<2)  /* Channel 5 generator select bit 2 mask. */
#define EVSYS_CHANNEL52_bp  2  /* Channel 5 generator select bit 2 position. */
#define EVSYS_CHANNEL53_bm  (1<<3)  /* Channel 5 generator select bit 3 mask. */
#define EVSYS_CHANNEL53_bp  3  /* Channel 5 generator select bit 3 position. */
#define EVSYS_CHANNEL54_bm  (1<<4)  /* Channel 5 generator select bit 4 mask. */
#define EVSYS_CHANNEL54_bp  4  /* Channel 5 generator select bit 4 position. */
#define EVSYS_CHANNEL55_bm  (1<<5)  /* Channel 5 generator select bit 5 mask. */
#define EVSYS_CHANNEL55_bp  5  /* Channel 5 generator select bit 5 position. */
#define EVSYS_CHANNEL56_bm  (1<<6)  /* Channel 5 generator select bit 6 mask. */
#define EVSYS_CHANNEL56_bp  6  /* Channel 5 generator select bit 6 position. */
#define EVSYS_CHANNEL57_bm  (1<<7)  /* Channel 5 generator select bit 7 mask. */
#define EVSYS_CHANNEL57_bp  7  /* Channel 5 generator select bit 7 position. */

